app/graphql/mutations/create_blog.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 40 LIMIT 1
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "user_id", "organization_id") VALUES ('Test Mutation', 'This is the testing body of the Mutation', '2024-08-21 11:54:17.125720', '2024-08-21 11:54:17.125720', '40', '1') RETURNING "id"
---
    def resolve(title:, body:, user_id:, organization_id:)
      user = User.find(user_id)
      blog = user.blogs.create(title: title, body: body, organization_id: organization_id)