app/views/devise/registrations/new.html.erb

SELECT "organizations".* FROM "organizations"
---
  <select name="organization_id">
  <% Organization.all.each do |org|%>