app/graphql/resolvers/blog_resolver.rb

      def resolve(id:)
        ::Blog.find(id)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = 1 LIMIT 1