app/graphql/resolvers/comment_resolver.rb

      def resolve(id:)
        ::Comment.find(id)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 2 LIMIT 1