app/graphql/resolvers/profile_resolver.rb

        def resolve(id:)
            ::Profile.find(id)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 22 LIMIT 1