app/graphql/resolvers/user_resolver.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 22 LIMIT 1
---
      def resolve(id:)
        ::User.find(id)