app/views/devise/sessions/new.html.erb

  <select name="organization_id">
    <% Organization.all.each do |org|%>
---
SELECT "organizations".* FROM "organizations"