app/controllers/blogs_controller.rb

  def index
    # debugger
    @organization_id = Membership.find_by(user_id:current_user.id).organization_id
    @organization = Organization.find_by(id:@organization_id)
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @organization_id = Membership.find_by(user_id:current_user.id).organization_id
    organization = Organization.find_by(id:@organization_id)
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? LIMIT ?  [["user_id", 40], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @organization_id = Membership.find_by(user_id:current_user.id).organization_id
    organization = Organization.find_by(id:@organization_id)
    @blog = organization.blogs.new(blog_params)
    @blog.user = current_user

    respond_to do |format|
      if @blog.save
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? LIMIT ?  [["user_id", 40], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? LIMIT ?  [["user_id", 48], ["LIMIT", 1]]
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "user_id", "organization_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "adf"], ["body", "asg"], ["created_at", "2024-08-14 07:50:53.195922"], ["updated_at", "2024-08-14 07:50:53.195922"], ["user_id", "40"], ["organization_id", "1"]]

  def destroy
    @blog.destroy!
---
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 3]]