app/controllers/comments_controller.rb

    def create
        # debugger
        @blog = Blog.find(params[:blog_id])
        @comment = Comment.create(comment_params)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "asdkfj"], ["body", "ksjdf"], ["blog_id", 9], ["created_at", "2024-08-16 11:45:48.432386"], ["updated_at", "2024-08-16 11:45:48.432386"]]