app/controllers/home_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 71], ["LIMIT", 1]]
---
  def index
    if user_signed_in?
      @profile = Profile.find_by(user_id: current_user.id)