app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)
    @profile.user_id = current_user.id
    if @profile.save
---
INSERT INTO "profiles" ("user_id", "full_name", "gender", "address", "contact_no", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      @profile = Profile.find(params[:id])
      @profile.update(profile_params)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "profiles" SET "full_name" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["full_name", "asdvvvaas"], ["updated_at", "2024-08-20 02:42:27.652415"], ["id", 22]]