app/controllers/users/registrations_controller.rb

SELECT "organizations".* FROM "organizations"
---
  def new
    @organization = Organization.all

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "memberships" ("user_id", "organization_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 45], ["organization_id", 1], ["created_at", "2024-08-15 06:44:33.826985"], ["updated_at", "2024-08-15 06:44:33.826985"]]
---
  def create
    @user = User.create(sign_up_params)
    if @user.save
      if organization.present?
        @user.membership.create(organization_id: @organization.id)

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def organization
         @organization = Organization.find(params[:organization_id])