app/controllers/users/sessions_controller.rb

SELECT "organizations".* FROM "organizations"
---
    def new
        @organization = Organization.all

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."organization_id" = ? AND "users"."email" = ? LIMIT ?  [["organization_id", 2], ["email", "test@mail.com"], ["LIMIT", 1]]
---
    def create
        @organization = Organization.find_by(id: params[:organization_id])
        @user = @organization.users.find_by(email: params[:user][:email])