app/views/layouts/application.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 72 LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 28 LIMIT 1
---
        <%= link_to 'Logout', destroy_user_session_path, method: :delete , data:{ turbo_method: :delete} %>
        <%if !Profile.find_by(user_id: current_user.id).nil?%>
          <% profile = Profile.find_by(id: current_user.profile.id)%>